docs(design): 统一UML图格式 && 修改数据迁移说法
